In [3]:
import numpy as np
import pandas as pd

reindex : index를 새롭게 설정하면, 이 index에 맞게 pandas 객체의 값(values)을 재배치. index에 해당되는 값이 없을 경우 NaN 할당.

In [4]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [7]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

ffill : 값을 채워넣어야 할 경우 사용. 누락된 값(missing value)을 이전 항목의 값으로 채움.

In [8]:
obj2.ffill()

a   -5.3
b    7.2
c    3.6
d    4.5
e    4.5
dtype: float64

In [17]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [23]:
obj4 = obj3.reindex(range(6)) 
#obj3.reindex(np.arange(6)) - 갯수가 많으면 numpy 사용!
obj4.ffill()

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [24]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

DataFrame에 대한 reindexing : 행과 열 모두 기존 index를 새롭게 변경 가능.
- 행은 리스트 형태로 전달하면 reindexing
- 열은 columns 속성에 지정해야 reindexing

In [25]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a','c','d'],
                     columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [26]:
new_idx = ['a','b','c','d']
frame2 = frame.reindex(new_idx)
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

ffill을 사용하는 대신 reindex할 때 빈 값을 채우는 옵션을 설정할 수도 있다.

In [41]:
frame22 = frame.reindex(new_idx, fill_value=0)
frame22

   Ohio  Texas  California
a     0      1           2
b     0      0           0
c     3      4           5
d     6      7           8

In [27]:
frame2.ffill(axis=0)

   Ohio  Texas  California
a   0.0    1.0         2.0
b   0.0    1.0         2.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [29]:
states = ['Texas','Utah','California']
frame3 = frame.reindex(columns=states)
frame3

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [30]:
frame3.ffill(axis=1)

   Texas  Utah  California
a    1.0   1.0         2.0
c    4.0   4.0         5.0
d    7.0   7.0         8.0

drop : 행 또는 열을 삭제한 새로운 pandas 객체를 생성

In [31]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [32]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [33]:
obj.drop(['d','c'])
#obj - 원본 Series 객체는 변경 사항 없음.

a    0.0
b    1.0
e    4.0
dtype: float64

DataFrame은 행과 열에서 값을 삭제할 수 있음.

In [35]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data.drop(['Colorado', 'Ohio'])  # 행 삭제. default(axis=0 생략 가능).
#data.drop(['Colorado', 'Ohio'], axis=0)
#data.drop(['Colorado', 'Ohio'], axis='rows')

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data.drop('two', axis=1) # 열 삭제
#data.drop('two', axis='columns') # 열 삭제

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [38]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

행 또는 열을 삭제한 새로운 객체를 만들지 않고 원본 객체를 직접 변경하려면 inplace=True 설정.

In [39]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64